<?php
$a=$_GET["a1"];// отримуємо данні з форми
if(empty($a)){// перевіряємо чи не була форма пустою
	echo "Значення не введено. Спробуйте заново";
}
else {//якщо форма не пуста то
	$at=trim($a);//змінній at присвоюємо отриманий рядок видаливши пробіли спочатку та в кінці рядка
$arr=explode(" ", $at);// перетворюємо рядок в массив використовуючи пробіл як роздільник
$c=count($arr);//Вираховуємо довжину массиву
for($i=0;$i<$c;$i++) {
	if(is_numeric($arr[$i])){//перевіряємо кожен елемент массиву на те чи є він число чи ні
		$poz=strpos($arr[$i],",");// шукаємо коми і крапки в кожному елементі массиву
		$pos=strpos($arr[$i],".");// це робиться для того щоб наступна перевірка не пропускала нецілочисельні змінні
		if($pos===false && $poz===false){//власне перевірка на цілочисельність
			$k=0;//якщо всі перевірки пройдені успішно то k присвоюємо нулю
		}
		else{
			$k=1; //якщо хоч одна перевірка не пройдена то k присвоюємо одиниці і виходимо з массиву
			$c=$i;
		}
		
	} 
	else {
		$k=1;
		$c=$i;
	} 
}
if($k==1){//перевіряємо чи k рівне одиниці і якщо так то просимо користувача ввести дані ще раз
	echo "Було введено не цілочисельний массив. Спробуйте заново";

}
else { //якщо k рівне нулю то виводимо массив
	foreach ($arr as $val) {
			echo "$val ";
		}	
}
}
?>