<?php
//присвоюємо змінній а- html форму
$a=<<<HD
<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
	<title></title>
</head>
<body>
	<form action="{$_SERVER['PHP_SELF']}" method="POST">
		<input type="text" name="a1"><br>
		<input type="submit" value="Enter" name="Enter">
	</form>
	
</body>
</html>
HD;
if(isset($_POST["Enter"])){//якщо кнопка Enter вже була натиснена виконуємо натупні дії
	$b=$_POST["a1"];//Змінній b присвоюємо введені значення
	if(empty($b)){//перевіряємо на пустоту
	echo "Значення не введено. Спробуйте заново";
	}
	else{
		$o=0;
		$r=rand(1,100);//рандомізуємо число
		$at=trim($b);//видаляємо пробіли на початку і кінці рядка
		$arr=explode(",", $at);// перетворюємо рядок в массив використовуючи кому як роздільник
		$c=count($arr);//рахуємо довжину массиву
		for($i=0;$i<$c;$i++) {
			if(is_numeric($arr[$i])){//перевірка на те є елементи массиву числами чи ні
			$pos=strpos($arr[$i],".");//перевірка на те чи містять елементи массиву крапку вона потрібна щоб не пропустити нецілочисельних елементів
			if($pos===false){
				$k=0;//якщо всі перевірки пройдено то k=0
			}
			else {
				$k=1;//якщо не пройдено хоч одну перевірку то k=1 і виходимо із массиву
				$c=$i;
			}
			}
		else {
				$k=1;
				$c=$i;
			}
	}
	if($k==1){// якщо k=1 то виводимо повідомлення про помилку
		echo "Було введено не массив натуральних чисел або числа з массиву були поза діапазоном від 1 до 100. Спробуйте заново<br>";
	}
	else {// якщо k=0 то
		for ($j=0;$j<$c;$j++) {
			if($r==$arr[$j]){ //робимо перевірку на співпадіння значень в массиві з випадково згенерованим спочатку значенням
				echo "Yes";
				$j=$c;//якщо співпадіння було виявлено то виводимо Yes виходимо з массиву і присвоюємо о=1
				$o=1;
			}
		}
		if($o==0){//якщо співпадіння виявлено не буде то о залишиться рівним 0 і ця перевірка буде пройдена тому виведеться No
			echo "No";
		}	
	}
}
}
else{//якщо на кнопку Enter ще не натискали то ми виводимо html форму реалізовану вище
  echo $a;
}
?>